_Rarzrabotki/Rarus/USO2/DataProcessors/уатЗагрузкаДанныхWialon.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>уатЗагрузкаДанныхWialon</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Comment>Дата начала периода</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Comment>Дата окончания периода</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатСистемаGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатСистемаGPS</Name>
			<Comment>Cистема мониторинга (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_1СЦСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dynafleet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Omnicomm</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wialon</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоГРАФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автотрекер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКАУТ</Name>
					<Comment>СКАУТ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/уатЗагрузкаДанныхWialon/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Константы.уатИспользоватьWialon.Получить() Тогда
		ТекстСообщения = НСтр("en='Opening is possible only when enabled using of GPS system Wialon.';ru='Открытие возможно только тогда, когда включено использование системы GPS - Wialon.'");
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ);
	КонецЕсли;
	
	ВосстановитьНастройки();
	
	ПроизвольныйПериод         = Новый СтандартныйПериод;
	ПроизвольныйПериод.Вариант = ВариантСтандартногоПериода.Вчера;
	Объект.ДатаС               = ПроизвольныйПериод.ДатаНачала;
	Объект.ДатаПо              = ПроизвольныйПериод.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТС

&НаКлиенте
Процедура ТСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Состояние(НСтр("ru = 'Добавлено ТС'") + " <" + Строка(ВыбранноеЗначение) + ">",,, БиблиотекаКартинок.Информация32);
	
	НайдСтроки = ТС.НайтиСтроки(Новый Структура("Ссылка", ВыбранноеЗначение));
	Если НайдСтроки.Количество() = 0 Тогда 
		НовСтрока = ТС.Добавить();
		НовСтрока.Ссылка = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	ТекстОшибки = "";
	Отказ = Ложь;
	
	Если ТС.Количество() = 0 Тогда 
		ТекстОшибки = НСтр("en='Not selected any vehicle';ru='Не выбрано ни одного ТС'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ТС",,Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаС) Тогда 
		ТекстОшибки = НСтр("en='Not filled start date of download';ru='Не заполнена дата начала загрузки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ДатаС",,Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПо) Тогда 
		ТекстОшибки = НСтр("en='Not filled end date of download';ru='Не заполнена дата окончания загрузки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ДатаПо",,Отказ);
	КонецЕсли;
	
	Если Объект.ДатаС > Объект.ДатаПо Тогда 
		ТекстОшибки = НСтр("en='Download start date cannot be greater than end date';ru='Дата начала загрузки не может быть больше даты окончания'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ДатаС",,Отказ);
	КонецЕсли;
	
	Если Не ЗагрузитьПробегИРасходГСМ И Не ЗагрузитьДополнительныеСведения И Не ЗагрузитьКоординаты Тогда 
		ТекстОшибки = НСтр("en='You must select at least one option to download (mileage and consumption/additional information)';ru='Необходимо выбрать хотя бы один параметр для загрузки (пробег и расход/дополнительные сведения/координаты)'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ЗагрузитьПробегИРасходГСМ",,Отказ);
	КонецЕсли;
	
	// Выполним загрузку
	Если Не Отказ Тогда 
		ТекстНСТР = НСтр("en='Load data GPS system Wialon';ru='Выполняется загрузка данных системы GPS Wialon'");
		Состояние(ТекстНСТР,,НСтр("en='This operation may take a long time';ru='Операция может занять длительное время'"));
		КодВозврата = ВыполнитьЗагрузкуСервер(ТекстОшибки);
		
		Если КодВозврата = 0 Тогда 
			ТекстПредупреждения = НСтр("en='Download data completed successfully';ru='Загрузка данных завершена успешно'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			
		ИначеЕсли КодВозврата = 2 Тогда 
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("Описание", ТекстОшибки + Символы.ПС + НСтр("ru = 'Продолжить?'"));
			ПараметрыФормы.Вставить("ПредупреждениеWialon", Истина);
			
			ОткрытьФорму(
				"ОбщаяФорма.уатПредупреждение", 
				ПараметрыФормы, 
				ЭтотОбъект,
				,
				,
				,
				Новый ОписаниеОповещения("ПодтверждениеЗагрузкиИзLocal", ЭтотОбъект),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
			);
			
		Иначе 
			Если СтрНайти(ТекстОшибки, "https://sdk.wialon.com/wiki/ru/sidebar/remoteapi/apiref/limits/limits") > 0 Тогда 
				ТекстПредупреждения = Новый ФорматированнаяСтрока(
					СтрЗаменить(ТекстОшибки, "https://sdk.wialon.com/wiki/ru/sidebar/remoteapi/apiref/limits/limits", ""),
					Новый ФорматированнаяСтрока(
						"https://sdk.wialon.com/wiki/ru/sidebar/remoteapi/apiref/limits/limits",
						,
						,
						,
						"https://sdk.wialon.com/wiki/ru/sidebar/remoteapi/apiref/limits/limits"
					)
				);
				
			Иначе 
				ТекстПредупреждения = Новый ФорматированнаяСтрока(
					НСтр("ru = 'Возникла ошибка при загрузке данных.'"),
					Символы.ПС,
					НСтр("ru = 'Описание ошибки:'"),
					Символы.ПС,
					ТекстОшибки,
					Символы.ПС,
					НСтр("ru = 'Перейти в'"),
					" """,
					Новый ФорматированнаяСтрока(НСтр("ru = 'Журнал регистрации'"),,,, "e1cib/app/Обработка.ЖурналРегистрации"),
					"""."
				);
			КонецЕсли;
			
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	ПроизвольныйПериод               = Новый СтандартныйПериод;
	ПроизвольныйПериод.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПроизвольныйПериод.ДатаНачала    = Объект.ДатаС;
	ПроизвольныйПериод.ДатаОкончания = Объект.ДатаПо;
	
	ДиалогВыбораПериода        = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период = ПроизвольныйПериод;
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалОбработкаВыбораПериода", ЭтотОбъект);
	ДиалогВыбораПериода.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТС(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.ТранспортныеСредства.ФормаВыбора", ПараметрыФормы, Элементы.ТС,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиТС(Команда)
	
	Если ТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ЗаполнитьВсемиТСОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена
		);
		
	Иначе 
		ЗаполнитьВсемиТСЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнение(Команда)
	
	Если ТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("РасширенноеЗаполнениеОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена
		);
		
	Иначе 
		РасширенноеЗаполнениеУстановитьОтбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТС(Команда)
	
	Если ТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОчиститьТаблицуТСОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table?';ru='Очистить таблицу?'"),
			РежимДиалогаВопрос.ДаНет
		);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодтверждениеЗагрузкиИзLocal(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если РезультатЗакрытия.БольшеНеПоказывать Тогда 
		СохранитьПризнакОтображенияПредупрежденияLocal();
	КонецЕсли;
	
	Если РезультатЗакрытия.Команда = КодВозвратаДиалога.ОК Тогда 
		ПродолжитьЗагрузкуLocal = Истина;
		ВыполнитьЗагрузку(Элементы.ФормаВыполнитьЗагрузку);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПризнакОтображенияПредупрежденияLocal()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"Обработка.уатЗагрузкаДанныхWialon", 
		"ПредупреждениеLocalБольшеНеПоказывать", 
		Истина
	);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
	
	СтруктураНастроек = Неопределено;
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда 
		СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(
			"Обработка.уатЗагрузкаДанныхWialon", 
			"НастройкиЗагрузки"
		);
	КонецЕсли;
	
	Если СтруктураНастроек = Неопределено Тогда 
		СтруктураНастроек = Новый Структура();
	КонецЕсли;
	
	Если Не СтруктураНастроек.Свойство("ЗагрузитьПробегИРасходГСМ") Тогда 
		СтруктураНастроек.Вставить("ЗагрузитьПробегИРасходГСМ", Истина);
	КонецЕсли;
	Если Не СтруктураНастроек.Свойство("ЗагрузитьДополнительныеСведения") Тогда 
		СтруктураНастроек.Вставить("ЗагрузитьДополнительныеСведения", Истина);
	КонецЕсли;
	Если Не СтруктураНастроек.Свойство("ЗагрузитьКоординаты") Тогда 
		СтруктураНастроек.Вставить("ЗагрузитьКоординаты", Истина);
	КонецЕсли;
	Если Не СтруктураНастроек.Свойство("СписокТС") Тогда 
		СтруктураНастроек.Вставить("СписокТС", Новый Массив());
	КонецЕсли;
	
	ЗагрузитьПробегИРасходГСМ       = СтруктураНастроек.ЗагрузитьПробегИРасходГСМ;
	ЗагрузитьДополнительныеСведения = СтруктураНастроек.ЗагрузитьДополнительныеСведения;
	ЗагрузитьКоординаты             = СтруктураНастроек.ЗагрузитьКоординаты;
	
	Для Каждого ТекТС Из СтруктураНастроек.СписокТС Цикл 
		НовСтрока = ТС.Добавить();
		НовСтрока.Ссылка = ТекТС;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("ЗагрузитьПробегИРасходГСМ",       ЗагрузитьПробегИРасходГСМ);
	СтруктураНастроек.Вставить("ЗагрузитьДополнительныеСведения", ЗагрузитьДополнительныеСведения);
	СтруктураНастроек.Вставить("ЗагрузитьКоординаты",             ЗагрузитьКоординаты);
	СтруктураНастроек.Вставить("СписокТС",                        Новый Массив());
	
	Для Каждого ТекСтрока Из ТС Цикл 
		СтруктураНастроек.СписокТС.Добавить(ТекСтрока.Ссылка);
	КонецЦикла;
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"Обработка.уатЗагрузкаДанныхWialon", 
		"НастройкиЗагрузки", 
		СтруктураНастроек
	);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗагрузкуСервер(ТекстОшибки)
	
	ТаблТС   = ТС.Выгрузить(,"Ссылка");
	МассивТС = ТаблТС.ВыгрузитьКолонку("Ссылка");
	
	КодВозврата = 0;
	
	ДатаНачала    = Объект.ДатаС;
	ДатаОкончания = Объект.ДатаПо;
	ТекущаяДата   = ТекущаяДатаСеанса();
	
	Если ДатаНачала > ТекущаяДата Тогда 
		ДатаНачала = ТекущаяДата;
	КонецЕсли;
	
	Если ДатаОкончания > ТекущаяДата Тогда 
		ДатаОкончания = ТекущаяДата;
	КонецЕсли;
	
	Если ДатаНачала >= ДатаОкончания Тогда 
		Возврат КодВозврата;
	КонецЕсли;
	
	КодВозврата = уатЗащищенныеФункцииСервер_проф.ПолучитьУчетнуюЗаписьСистемыМониторингаДляТС(МассивТС, Перечисления.уатСистемаGPS.Wialon);
	
	Для Каждого ТекСтрока Из МассивТС Цикл
		
		УчетнаяЗаписьСистемыМониторинга = ТекСтрока.УчетнаяЗаписьСистемыМониторинга;
		
		Если КодВозврата = 0 И ЗагрузитьПробегИРасходГСМ Тогда // Загружаем пробег и расход ГСМ.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьМестоположениеПоТСWialon(ДатаНачала, ДатаОкончания, ТекСтрока.ТС, ТекстОшибки, ПродолжитьЗагрузкуLocal, УчетнаяЗаписьСистемыМониторинга);
		КонецЕсли;
		
		Если КодВозврата = 0 И ЗагрузитьДополнительныеСведения Тогда // Загружаем дополнительные сведения.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьДополнительныеСведенияПоТСWialon(ДатаНачала, ДатаОкончания, ТекСтрока.ТС, ТекстОшибки, ПродолжитьЗагрузкуLocal, УчетнаяЗаписьСистемыМониторинга);
		КонецЕсли;
		
		Если КодВозврата = 0 И ЗагрузитьКоординаты Тогда // Загружаем координаты.
			КодВозврата = уатЗащищенныеФункцииСервер_проф.ЗагрузитьКоординатыПоТСWialon(ДатаНачала, ДатаОкончания, ТекСтрока.ТС, ТекстОшибки, ПродолжитьЗагрузкуLocal, УчетнаяЗаписьСистемыМониторинга);
		КонецЕсли;
		
		Если КодВозврата = 1 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КодВозврата;
	
КонецФункции // ВыполнитьЗагрузкуСервер()

&НаКлиенте
Процедура УстановитьИнтервалОбработкаВыбораПериода(Период, Параметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаС  = Период.ДатаНачала;
	Объект.ДатаПо = Период.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиТСОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТС.Очистить();
		ЗаполнитьВсемиТСЗавершение();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		ЗаполнитьВсемиТСЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсемиТСЗавершение()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныеСредства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|ГДЕ
	|	НЕ ТранспортныеСредства.ПометкаУдаления
	|	И ТранспортныеСредства.уатИспользуемаяСистемаGPS = ЗНАЧЕНИЕ(Перечисление.уатСистемаGPS.Wialon)
	|	И НЕ ТранспортныеСредства.уатИДвСистемеНавигации = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НовСтрока = ТС.Добавить();
		НовСтрока.Ссылка = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТС.Очистить();
		РасширенноеЗаполнениеУстановитьОтбор();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		РасширенноеЗаполнениеУстановитьОтбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеУстановитьОтбор()
	
	ОткрытьФорму(
		"ОбщаяФорма.уатФормаПодбораТС", 
		Новый Структура("ИсточникПодбора", "Обработка_уатЗагрузкаДанныхWialon"), 
		ЭтотОбъект,
		,
		,
		,
		Новый ОписаниеОповещения("РасширенноеЗаполнениеЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекТС Из РезультатЗакрытия Цикл 
		НовСтрока = ТС.Добавить();
		НовСтрока.Ссылка = ТекТС;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТСОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТС.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
